Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/Forms/РезультатКомпоновкиДанных/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок 	= SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Заголовок");
	СхемаКД 	= SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СхемаКомпоновкиДанных");
	НастройкиКД = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НастройкиКомпоновкиДанных");
	
	Элементы.ИнформацияНачальнаяСтраница.Заголовок = Заголовок;
	
	Если ТипЗнч(СхемаКД) = Тип("Строка") Тогда
		СхемаКД = SUI_ОбщегоНазначения.ЗначениеИзСтрокиXML(СхемаКД);
	КонецЕсли;
	
	Если ТипЗнч(НастройкиКД) = Тип("Строка") Тогда
		НастройкиКД = SUI_ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкиКД);
	КонецЕсли;
	
	Если ТипЗнч(СхемаКД) <> Тип("СхемаКомпоновкиДанных") Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось определить схему компоновки данных'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось определить настройки компоновки данных'"));
		НастройкиКД = СхемаКД.НастройкиПоУмолчанию;
	КонецЕсли;
	
	Попытка
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(Компоновщик);
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, СхемаКД, НастройкиКД);
		НастройкиКД = Компоновщик.ПолучитьНастройки();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось инициализировать настройки компоновщика'"), , , , Отказ);
		Возврат;
	КонецПопытки;
	
	ДанныеДляКомпоновки = ПоместитьВоВременноеХранилище(
		Новый Структура("Схема, Настройки", СхемаКД, НастройкиКД), 
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьФормироватьРезультат();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьРезультат(Команда)
	
	НачатьФормироватьРезультат();
	
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяСтраница(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаНачальная;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьФормироватьРезультат()
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	
	КраткоеПредставлениеОшибки = "";
	ПодробноеПредставлениеОшибки = "";
	
	ДлительнаяОперация = НачатьФормироватьРезультатНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
//	ПараметрыОжидания.ОтменятьПриЗакрытииФормыВладельца = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьФормироватьРезультатЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьФормироватьРезультатНаСервере()
	
	Если ЗначениеЗаполнено(ДанныеДляКомпоновки) И ЭтоАдресВременногоХранилища(ДанныеДляКомпоновки) Тогда
		Данные = ПолучитьИзВременногоХранилища(ДанныеДляКомпоновки);
	Иначе
		Данные = Новый Структура();;
	КонецЕсли;

	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("СхемаКомпоновкиДанных", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "Схема"));
	ПараметрыПроцедуры.Вставить("НастройкиКомпоновкиДанных", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "Настройки"));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"РегистрыСведений.SUI_НастройкиТаблицИнтеграции.СформироватьТабличныйДокументРезультатПоСхеме", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура НачатьФормироватьРезультатЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаНачальная;
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		КраткоеПредставлениеОшибки = Результат.КраткоеПредставлениеОшибки;
		ПодробноеПредставлениеОшибки = Результат.ПодробноеПредставлениеОшибки;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		ТабличныйДокументРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРезультат;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаНачальная;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
